Exploratory Data Analysis Part I: Find problems in the data.

In [1]:
import pandas as pd

%load_ext sql

Establish a connection to the data base
Before you run the following cell:
Create a text file called .env conataining

PGSQL_USER=USERNAME  \
PGSQL_PASSWORD= PASSWORD 

Note: I (Cannur) created .env file with my credentials so you do not need to create it. You can run it directly.

In [2]:
from dotenv import load_dotenv
import os

load_dotenv()
username = os.getenv('PGSQL_USER')
password = os.getenv('PGSQL_PASSWORD')
hostname = 'gip.itc.utwente.nl'
portname = '5434'
databasename = 'c211'

%sql postgresql://{username}:{password}@{hostname}:{portname}/{databasename}

Now, we can find the database has how many rows.

In [3]:
%sql \
select count(*) as Row_Counts\
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(2530161,)]

Now, we can see the first 3 rows.

In [4]:
%%sql 
Select * from vw_observation2017
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(2428631, '30', '18758', datetime.date(2017, 5, 6), 23108, 170, 499, '12:38', 33408089),
 (2901370, '336', '18758', datetime.date(2017, 3, 24), 14056, 133, 454, '14:27', 33408095),
 (2792431, '111', '18758', datetime.date(2017, 3, 30), 15713, 140, 490, '10:57', 33408097)]

We can see the first 3 rows for the other tables.

In [5]:
%%sql 
Select * from vw_myblock
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(44608, 202, 318, '01030000204071000001000000050000000000000080A8084100000000C06813410000000080A80841000000006078134100000000C0C70841000000006078134100000000C0C7084100000000C06813410000000080A8084100000000C0681341', '870134'),
 (44609, 177, 310, '010300002040710000010000000500000000000000409B054100000000C0EB124100000000409B05410000000060FB12410000000080BA05410000000060FB12410000000080BA054100000000C0EB124100000000409B054100000000C0EB1241', '870135'),
 (44610, 174, 314, '010300002040710000010000000500000000000000803D054100000000402A134100000000803D054100000000E039134100000000C05C054100000000E039134100000000C05C054100000000402A134100000000803D054100000000402A1341', '870136')]

In [6]:
%%sql 
Select * from vw_myblocklanduse
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'Hoofdweg', 1, 6537.33085031952),
 (60, 'Landbouw', 1, 871977.654549437),
 (60, 'Recreatie', 1, 39618.6174416008)]

In [7]:
%%sql 
Select * from vw_roadlengths
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(2, '0103000020407100000100000005000000000000000088C3400000000080AE1741000000000088C3400000000020BE174100000000007CC5400000000020BE174100000000007CC5400000000080AE1741000000000088C3400000000080AE1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (3, '0103000020407100000100000005000000000000000088C3400000000020BE1741000000000088C34000000000C0CD174100000000007CC54000000000C0CD174100000000007CC5400000000020BE1741000000000088C3400000000020BE1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (4, '0103000020407100000100000005000000000000000088C34000000000C0CD1741000000000088C3400000000060DD174100000000007CC5400000000060DD174100000000007CC54000000000C0CD1741000000000088C34000000000C0CD1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0)]

In [8]:
%%sql 
Select * from precipitation
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(90483, 20170101, 53.3103, 5.81527, 2.89373, '010100002040710000A8A7326A626706413B586AE5120E2241', 26506),
 (90483, 20170102, 53.3103, 5.81527, 1.79938, '010100002040710000A8A7326A626706413B586AE5120E2241', 26506),
 (90483, 20170103, 53.3103, 5.81527, 2.69446, '010100002040710000A8A7326A626706413B586AE5120E2241', 26506)]

In [9]:
%%sql 
Select * from temperature
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(21944, 20170424, 51.2509, 3.80463, 15.0413, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170425, 51.2509, 3.80463, 10.3514, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170614, 51.2509, 3.80463, 26.1349, '0101000020407100009634E9AF99BCE540883057F634311641', 1439)]

In [10]:
%%sql 
Select * from block_demography
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(167, 18, 375, '0103000020407100000100000005000000000000000094D1400000000060E31641000000000094D1400000000000F3164100000000008ED2400000000000F3164100000000008ED2400000000060E31641000000000094D1400000000060E31641', 5, 115, 1005, 1755, 4275, 8715, 9390, 9565),
 (168, 18, 376, '0103000020407100000100000005000000000000000094D1400000000000F31641000000000094D14000000000A002174100000000008ED24000000000A002174100000000008ED2400000000000F31641000000000094D1400000000000F31641', 10, 450, 1070, 1725, 3885, 6915, 9220, 9525),
 (169, 18, 377, '0103000020407100000100000005000000000000000094D14000000000A0021741000000000094D140000000004012174100000000008ED240000000004012174100000000008ED24000000000A0021741000000000094D14000000000A0021741', 0, 475, 625, 1660, 1885, 6515, 7420, 9345)]

In [11]:
%%sql 
Select * from block_road_access
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'W', 1, 900.48733374501),
 (61, 'W', 1, 1656.38376965095),
 (62, 'G', 1, 656.363163271632)]

In [12]:
%%sql 
Select * from days
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(20170102, datetime.date(2017, 1, 2), 2, 1, False),
 (20170103, datetime.date(2017, 1, 3), 3, 2, False),
 (20170104, datetime.date(2017, 1, 4), 4, 3, False)]

We can find how many observer, different species and different blocks.

In [13]:
%%sql 
Select count(distinct observer) as Number_of_Observer
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(11805,)]

In [14]:
%%sql 
Select count(distinct species) as Number_of_Species
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(464,)]

In [15]:
%%sql 
Select count(distinct block) as Number_of_block
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(33535,)]

We can check the null cells.

In [16]:
%%sql 
select count(*) 
from vw_observation2017 
where id isnull or 
 species isnull or 
 observer isnull or
 obsdate isnull or 
 block isnull or 
 longit isnull or
 latit isnull or
 obstime isnull or
 idd isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

In [17]:
%%sql 
select count(*) 
from vw_observation2017 
where obstime isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]